In [1]:
import numpy as np
import pandas as pd
from sklearn.impute import KNNImputer,SimpleImputer
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [3]:
df =pd.read_csv('train.csv',usecols =['Age','Pclass','Fare','Survived'])

In [67]:
df

     Survived  Pclass   Age     Fare
0           0       3  22.0   7.2500
1           1       1  38.0  71.2833
2           1       3  26.0   7.9250
3           1       1  35.0  53.1000
4           0       3  35.0   8.0500
..        ...     ...   ...      ...
886         0       2  27.0  13.0000
887         1       1  19.0  30.0000
888         0       3   NaN  23.4500
889         1       1  26.0  30.0000
890         0       3  32.0   7.7500

[891 rows x 4 columns]

In [69]:
df.head()

   Survived  Pclass   Age     Fare
0         0       3  22.0   7.2500
1         1       1  38.0  71.2833
2         1       3  26.0   7.9250
3         1       1  35.0  53.1000
4         0       3  35.0   8.0500

In [71]:
df.isnull().mean()*100

Survived     0.00000
Pclass       0.00000
Age         19.86532
Fare         0.00000
dtype: float64

In [73]:
X = df.drop(columns=['Survived'])
y = df['Survived']

In [75]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [77]:
X_train.head()

     Pclass   Age     Fare
30        1  40.0  27.7208
10        3   4.0  16.7000
873       3  47.0   9.0000
182       3   9.0  31.3875
876       3  20.0   9.8458

In [79]:
knn =KNNImputer(n_neighbors=3,weights='distance') # 0R
#knn =knnIMPUTER()   #   weights more efficient working recprocal of distance
X_train_trf =knn.fit_transform(X_train)             
X_test_trf =knn.fit_transform(X_test)

In [81]:
pd.DataFrame(X_train_trf,columns = X_train.columns)

     Pclass        Age      Fare
0       1.0  40.000000   27.7208
1       3.0   4.000000   16.7000
2       3.0  47.000000    9.0000
3       3.0   9.000000   31.3875
4       3.0  20.000000    9.8458
..      ...        ...       ...
707     3.0  30.000000    8.6625
708     3.0  26.151292    8.7125
709     1.0  71.000000   49.5042
710     1.0  32.666667  221.7792
711     1.0  49.762895   25.9250

[712 rows x 3 columns]

In [83]:
Ir = LogisticRegression()
Ir.fit(X_train_trf,y_train)
y_pred = Ir.predict(X_test_trf)
accuracy_score(y_pred,y_test)

0.7094972067039106

In [84]:
si =SimpleImputer()
X_train1 = si.fit_transform(X_train)
X_test1 =si.fit_transform(X_test)

In [87]:
Ir = LogisticRegression()
Ir.fit(X_train1,y_train)
y_pred = Ir.predict(X_test1)
accuracy_score(y_pred,y_test)

0.6927374301675978